In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('examples/ex1.csv', sep=',') # 쉼표를 이용한 받아들이기

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
pd.read_csv('examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [11]:
pd.read_csv('examples/ex2.csv', names = ['a', 'b', 'c', 'd', 'message']) # 직접 이름 column 이름 설정 가능

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
names =['a', 'b', 'c', 'd', 'message']

pd.read_csv('examples/ex2.csv', names = names, index_col = 'message') # column 이름의 일부를 가져와서 사용할 수 있다

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [14]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                       index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [15]:
list(open('pydata-book/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [17]:
result = pd.read_table('pydata-book/examples/ex3.txt', sep = '\s+') # \s+ 정규 표현식을 이용하여 표현 가능
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [18]:
!cat pydata-book/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [19]:
pd.read_csv('pydata-book/examples/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [20]:
pd.read_csv('pydata-book/examples/ex4.csv', skiprows=[0,2,3]) # 다음 변수로 특정 row를 스킵할 수 있다

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!cat pydata-book/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [22]:
result1 = pd.read_csv('pydata-book/examples/ex5.csv')
result1

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
pd.isnull(result1) # 공백인 부분 찾기

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [24]:
result1 = pd.read_csv('pydata-book/examples/ex5.csv', na_values=['NULL']) # 문자열 집합을 받아서 누락된 값을 처리
result1

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('pydata-book/examples/ex5.csv', na_values=sentinels) # 다음 값들을 모두 공백 처리할 수 있다

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

# 6.1.1 텍스트 파일 조금씩 불러오기

In [31]:
pd.options.display.max_rows =10 # 10개만 출력하도록 설정하는 법

In [32]:
result2 = pd.read_csv('pydata-book/examples/ex6.csv')
result2

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [34]:
pd.read_csv('pydata-book/examples/ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [36]:
chunker = pd.read_csv('pydata-book/examples/ex6.csv', chunksize=1000) # 파일을 여러 조각으로 나누어 읽는 법
chunker

# 6.1.2 데이터를 텍스트 형식으로 기록하기

In [37]:
data = pd.read_csv('pydata-book/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
data.to_csv('pydata-book/examples/out.csv')  # to_csv 를 이용하면 쉼표로 구분된 형식으로 파일에 쓸 수 있다
!cat pydata-book/examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [39]:
import sys

In [40]:
data.to_csv(sys.stdout, sep='|')  # sep 을 이용해서 원하는 문자로 나눌 수 있다

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [41]:
data.to_csv(sys.stdout, na_rep='NULL')  # 공백을 NULL처리 할 수 있다

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [42]:
data.to_csv(sys.stdout, index= False, header=False)   # 옆과 같이 설정하면 인덱스와 컬럼네임을 없앨 수 있다

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

# 6.1.3 구분자 형식 다루기

In [43]:
!cat pydata-book/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [44]:
import csv

In [45]:
f = open('pydata-book/examples/ex7.csv')
reader = csv.reader(f)  # 파일을 읽는 방법으로 순회시키면, 큰 따옴표를 없앤 튜플형식으로 받을 수 있다

In [46]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [48]:
with open('pydata-book/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [49]:
header, values = lines[0], lines[1:]

In [50]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [51]:
# reader을 이용해서 값을 받을 때, delimiter을 이용해 나누는 값을 확인할 수 있다.

# 6.1.4 JSON 데이터

- 웹브라우저와 다른 app이 http 요청으로 데이터를 보낼 때 사용하는 표준 파일 형식
- 표 형식보다 유연한 데이터 형식
- json 을 부르기 위해서는 json.loads 를 이용해서 값을 부를 수 있다

- 파이썬 객체를 json으로 바꾸기 위해서는 json.dumps 를 이용할 수 있다
- 또한 dataFrame을 이용해서 자동으로 json 데이터 셋을 바꿀 수 있다

In [55]:
!cat pydata-book/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [56]:
data = pd.read_json('pydata-book/examples/example.json')

In [57]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# 6.1.5 XML과 HTML: 웹 스크래핑

In [58]:
tables = pd.read_html('pydata-book/examples/fdic_failed_bank_list.html')
len(tables)

1

In [59]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [60]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [61]:
# lxml.objectify를 이용해서 xml 파싱하기

- xml: 계층적 구조와 메타데이터를 포함하는 중첩된 데이터 구조를 지원하는 데이터 형식

In [62]:
from lxml import objectify

path = 'pydata-book/datasets/mta_perf/Performance_MNR.xml'
parsed1 = objectify.parse(open(path))
root = parsed1.getroot()

In [63]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [64]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

# 6.2 이진 데이터 형식

- 효율적 데이터 방법: pickle - 직렬화
- pandas 객체는 모두 pickle을 이용해서 데이터를 저장하는 to_pickle 메서드를 가지고 있다

In [69]:
frame = pd.read_csv('pydata-book/examples/ex2.csv')
frame

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [72]:
frame.to_pickle('pydata-book/examples/frame_pickle') # 변환하고 가져오기 가능

In [73]:
pd.read_pickle('pydata-book/examples/frame_pickle')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

# 6.2.1 HDF5 형식 사용하기

In [83]:
frame1 = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame1
store['obj1_col'] = frame1['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [84]:
store['obj1']

           a
0  -0.465054
1   0.309033
2  -2.959776
3   0.239340
4  -0.912331
..       ...
95 -0.007028
96 -0.181360
97  0.315035
98 -0.457905
99 -0.528660

[100 rows x 1 columns]

In [85]:
store.put('obj2', frame1, format = 'table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.550543
11 -1.546002
12 -0.093894
13 -0.574902
14  0.279734
15 -0.591873

In [87]:
store.close()

In [88]:
frame1.to_hdf('mydata.h5', 'obj3', format = 'table')
pd.read_hdf('mydata.h5', 'obj3', where = ['index  < 5']) # 닫았는데 왜 열려있다고 인식이 되지?

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).

# 6.2.2 마이크로소프트 엑셀 파일에서 데이터 읽어오기

In [89]:
xlsx = pd.ExcelFile('pydata-book/examples/ex1.xlsx')

In [90]:
pd.read_excel(xlsx, 'Sheet1')  # 엑셀파일 1번 시트의 내용을 받아온다

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [91]:
frame2 = pd.read_excel('pydata-book/examples/ex1.xlsx', 'Sheet1')
frame2

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [92]:
writer = pd.ExcelWriter('pydata-book/examples/ex2.xlsx') # 저장하는 법
frame2.to_excel(writer, 'Sheet1')
writer.save()

In [93]:
frame2.to_excel('pydata-book/examples/ex2.xlsx')

# 6.3 웹 API와 함께 사용하기

In [94]:
import requests

In [95]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)

In [96]:
resp

In [97]:
data1 = resp.json()

In [98]:
data1[0]['title']

'ENH: vector methods for conversion from Period to its ordinal and back'

In [99]:
issues = pd.DataFrame(data1, columns= ['numbers', 'title', 'labels', 'states'])

In [100]:
issues

,numbers,title,labels,states
0,NaN,ENH: vector methods for conversion from Period...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",NaN
1,NaN,CLN: Styler HTML output adopt structured code ...,[],NaN
2,NaN,BUG: Styler HTML is unstructured,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",NaN
3,NaN,CLN: Use kwargs instead of kwds in apply funct...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",NaN
4,NaN,CI/TST: Disallow usage of pytest.xfail,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",NaN
...,...,...,...,...
25,NaN,BUG: read_excel with engine=openpyxl is includ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",NaN
26,NaN,GH38482 : added warning in docs to show -1 wil...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",NaN
27,NaN,BUG: Series.where behaves inconsistent,"[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",NaN
28,NaN,DOC: Group optional dependencies by relevant t...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",NaN
29,NaN,DOC: Enhance docs for Styler: details and high...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",NaN

# 6.4 데이터 베이스와 함께 사용하기

- sql(관계형 데이터 베이스) 를 이용한 방법

In [101]:
import sqlite3

In [105]:
query = """CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER
);"""

In [106]:
con = sqlite3.connect('mydata.sqlite')

In [107]:
con.execute(query)

In [108]:
con.commit()

In [109]:
data2 = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'Californial', 1.7, 5)]

In [110]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [111]:
con.executemany(stmt, data2)

In [112]:
con.commit()

In [113]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'Californial', 1.7, 5)]

In [114]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [115]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

             a            b     c  d
0      Atlanta      Georgia  1.25  6
1  Tallahassee      Florida  2.60  3
2   Sacramento  Californial  1.70  5

In [116]:
# 위의 과정은 매우 불편하다 따라서 아래의 방법을 사용

In [117]:
import sqlalchemy as sqla

In [118]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [119]:
pd.read_sql('select * from test', db)

             a            b     c  d
0      Atlanta      Georgia  1.25  6
1  Tallahassee      Florida  2.60  3
2   Sacramento  Californial  1.70  5